---
type: Camera
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 15
tags: [revit-api, class]
---

# Camera

`Autodesk.Revit.DB.DirectContext3D.Camera` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | Camera | 2017 | `public Camera ( Camera other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Transform | 2017 | `public void Transform ( Transform trf )` |
| Property | EyePosition | 2017 | `public XYZ EyePosition { get ; set ; }` |
| Property | FarDistance | 2017 | `public double FarDistance { get ; set ; }` |
| Property | HorizontalExtent | 2017 | `public double HorizontalExtent { get ; set ; }` |
| Property | HorizontalOffset | 2017 | `public double HorizontalOffset { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NearDistance | 2017 | `public double NearDistance { get ; set ; }` |
| Property | ProjectionMethod | 2017 | `public ProjectionMethod ProjectionMethod { get ; set ; }` |
| Property | TargetDistance | 2017 | `public double TargetDistance { get ; set ; }` |
| Property | UpDirection | 2017 | `public XYZ UpDirection { get ; set ; }` |
| Property | VerticalExtent | 2017 | `public double VerticalExtent { get ; set ; }` |
| Property | VerticalOffset | 2017 | `public double VerticalOffset { get ; set ; }` |
| Property | ViewDirection | 2017 | `public XYZ ViewDirection { get ; set ; }` |